{"nbformat":4,"nbformat_minor":0,"metadata":{"interpreter":{"hash":"6b2186e92e5ccf417916dae32a12ace57b536e5d87ebf6bec9f55d3d305f6e91"},"kernelspec":{"display_name":"Python 3.9.2 64-bit ('geo_env': conda)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.2"},"orig_nbformat":4,"colab":{"name":"esercitazioneVerifica.ipynb","provenance":[]}},"cells":[{"cell_type":"code","metadata":{"id":"KSn2jwvnDttA","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1637828523956,"user_tz":-60,"elapsed":6075,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}},"outputId":"66468d52-b980-43fb-dc85-12fbce8a41e9"},"source":["!pip install neo4j-driver\n","from neo4j import GraphDatabase, basic_auth\n","import pandas as pd"],"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting neo4j-driver\n","  Downloading neo4j-driver-4.4.0.tar.gz (89 kB)\n","\u001b[?25l\r\u001b[K     |███▊                            | 10 kB 24.6 MB/s eta 0:00:01\r\u001b[K     |███████▍                        | 20 kB 11.8 MB/s eta 0:00:01\r\u001b[K     |███████████                     | 30 kB 9.7 MB/s eta 0:00:01\r\u001b[K     |██████████████▊                 | 40 kB 8.8 MB/s eta 0:00:01\r\u001b[K     |██████████████████▍             | 51 kB 5.0 MB/s eta 0:00:01\r\u001b[K     |██████████████████████          | 61 kB 5.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████▊      | 71 kB 5.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████████▍  | 81 kB 6.2 MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 89 kB 3.3 MB/s \n","\u001b[?25hRequirement already satisfied: pytz in /usr/local/lib/python3.7/dist-packages (from neo4j-driver) (2018.9)\n","Building wheels for collected packages: neo4j-driver\n","  Building wheel for neo4j-driver (setup.py) ... \u001b[?25l\u001b[?25hdone\n","  Created wheel for neo4j-driver: filename=neo4j_driver-4.4.0-py3-none-any.whl size=114976 sha256=1bd7e397d7825c31592252ddea3523821808147040285b904f6a2d432e8ee297\n","  Stored in directory: /root/.cache/pip/wheels/5e/89/23/48d22f30bfad0866aac1078fb2e24db1dd3750c46198557ffe\n","Successfully built neo4j-driver\n","Installing collected packages: neo4j-driver\n","Successfully installed neo4j-driver-4.4.0\n"]}]},{"cell_type":"code","metadata":{"id":"iBiBKt9jDttE","executionInfo":{"status":"ok","timestamp":1637828527741,"user_tz":-60,"elapsed":414,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}}},"source":["driver = GraphDatabase.driver(\n","  \"bolt://3.235.155.226:7687\",\n","  auth=basic_auth(\"neo4j\", \"spring-acronyms-assembly\"))"],"execution_count":3,"outputs":[]},{"cell_type":"code","metadata":{"id":"r9wgaFZ1DttF","executionInfo":{"status":"ok","timestamp":1637828530245,"user_tz":-60,"elapsed":384,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}}},"source":["def read_cypher(query):\n","    with driver.session(database=\"neo4j\") as session:\n","        results = session.run(query).data()\n","        df = pd.DataFrame(results)\n","        col_names = df.columns.values.tolist()\n","        for c in col_names:\n","            if type(df[c].iloc[0]) is dict:\n","                df = pd.concat([df, df[c].apply(pd.Series)], axis=1)\n","                df.drop(columns=c, inplace=True)\n","            else:\n","                df1 = df.pop(c)\n","                df[c] = df1\n","        return df"],"execution_count":4,"outputs":[]},{"cell_type":"code","metadata":{"id":"yYX5Y2TxDttF","colab":{"base_uri":"https://localhost:8080/","height":423},"executionInfo":{"status":"ok","timestamp":1637792827899,"user_tz":-60,"elapsed":412,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}},"outputId":"607b32ef-c743-46b6-8ae6-0d3ad0a5a479"},"source":["#1. Il cognome e il nome dei poliziotti presenti nel database. Ordinare in ordine alfabetico.\n","\n","cypher_query = '''\n","\n","MATCH (o:Officer)\n","RETURN o.name,o.surname ORDER BY o.name\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>o.name</th>\n","      <th>o.surname</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Abagael</td>\n","      <td>McArthur</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Abbi</td>\n","      <td>Gove</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Abel</td>\n","      <td>Hierro</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Abraham</td>\n","      <td>Henbury</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Adair</td>\n","      <td>Glasby</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>995</th>\n","      <td>Yul</td>\n","      <td>Buddle</td>\n","    </tr>\n","    <tr>\n","      <th>996</th>\n","      <td>Zackariah</td>\n","      <td>Rosenfrucht</td>\n","    </tr>\n","    <tr>\n","      <th>997</th>\n","      <td>Zeb</td>\n","      <td>Blazewski</td>\n","    </tr>\n","    <tr>\n","      <th>998</th>\n","      <td>Zelda</td>\n","      <td>Pattinson</td>\n","    </tr>\n","    <tr>\n","      <th>999</th>\n","      <td>Zorina</td>\n","      <td>Damrell</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>1000 rows × 2 columns</p>\n","</div>"],"text/plain":["        o.name    o.surname\n","0      Abagael     McArthur\n","1         Abbi         Gove\n","2         Abel       Hierro\n","3      Abraham      Henbury\n","4        Adair       Glasby\n","..         ...          ...\n","995        Yul       Buddle\n","996  Zackariah  Rosenfrucht\n","997        Zeb    Blazewski\n","998      Zelda    Pattinson\n","999     Zorina      Damrell\n","\n","[1000 rows x 2 columns]"]},"metadata":{},"execution_count":4}]},{"cell_type":"code","metadata":{"id":"7fhqOK1wDttH","colab":{"base_uri":"https://localhost:8080/","height":423},"executionInfo":{"status":"ok","timestamp":1637792830086,"user_tz":-60,"elapsed":376,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}},"outputId":"83f0bc99-6dfb-4451-add1-af37dc067713"},"source":["#2. Il cognome e il nome dei poliziotti che hanno il grado (rank) di &#39;Police Constable&#39;\n","\n","cypher_query = '''\n","\n","MATCH (o:Officer {rank:'Police Constable'})\n","RETURN o.name,o.surname\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>o.name</th>\n","      <th>o.surname</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Christian</td>\n","      <td>Hannam</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Aguie</td>\n","      <td>Clampett</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Von</td>\n","      <td>Death</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Isak</td>\n","      <td>Basley</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Marketa</td>\n","      <td>Aykroyd</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>370</th>\n","      <td>Eloisa</td>\n","      <td>Mayoh</td>\n","    </tr>\n","    <tr>\n","      <th>371</th>\n","      <td>Hortense</td>\n","      <td>Shearme</td>\n","    </tr>\n","    <tr>\n","      <th>372</th>\n","      <td>Kassey</td>\n","      <td>Nias</td>\n","    </tr>\n","    <tr>\n","      <th>373</th>\n","      <td>Hertha</td>\n","      <td>Emerine</td>\n","    </tr>\n","    <tr>\n","      <th>374</th>\n","      <td>Stanislaw</td>\n","      <td>Livings</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>375 rows × 2 columns</p>\n","</div>"],"text/plain":["        o.name o.surname\n","0    Christian    Hannam\n","1        Aguie  Clampett\n","2          Von     Death\n","3         Isak    Basley\n","4      Marketa   Aykroyd\n","..         ...       ...\n","370     Eloisa     Mayoh\n","371   Hortense   Shearme\n","372     Kassey      Nias\n","373     Hertha   Emerine\n","374  Stanislaw   Livings\n","\n","[375 rows x 2 columns]"]},"metadata":{},"execution_count":5}]},{"cell_type":"code","metadata":{"id":"vmolayTEDttH","colab":{"base_uri":"https://localhost:8080/","height":175},"executionInfo":{"status":"ok","timestamp":1637792832560,"user_tz":-60,"elapsed":246,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}},"outputId":"183c2e44-228d-472d-c8f5-9f2636dff8ed"},"source":["#3. I crimini in cui sono coinvolte BMW modello M o Mercedes-Benz modello M-Class (model)\n","\n","cypher_query = '''\n","\n","MATCH (v:Vehicle)-[:INVOLVED_IN]->(c:Crime)\n","WHERE v.make = 'BMW' AND v.model = 'M' OR v.make = 'Mercedes-Benz' AND v.model = 'M-Class'\n","RETURN c\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>date</th>\n","      <th>id</th>\n","      <th>type</th>\n","      <th>last_outcome</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>4/08/2017</td>\n","      <td>a42699bed37958abb8c9096df66a3d533b17540b632141...</td>\n","      <td>Vehicle crime</td>\n","      <td>Investigation complete; no suspect identified</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>28/08/2017</td>\n","      <td>da187294ebd822e6651308e4a2987bbf56e0ab2c9d22d9...</td>\n","      <td>Vehicle crime</td>\n","      <td>Investigation complete; no suspect identified</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>4/08/2017</td>\n","      <td>547b8f2b12aea51b8f0eb229aaa4ec0370f4e67c7d3e1d...</td>\n","      <td>Vehicle crime</td>\n","      <td>Investigation complete; no suspect identified</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>29/08/2017</td>\n","      <td>74dfbc7365739859002b3f3f8e932975e3c64350a564c3...</td>\n","      <td>Vehicle crime</td>\n","      <td>Investigation complete; no suspect identified</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["         date  ...                                   last_outcome\n","0   4/08/2017  ...  Investigation complete; no suspect identified\n","1  28/08/2017  ...  Investigation complete; no suspect identified\n","2   4/08/2017  ...  Investigation complete; no suspect identified\n","3  29/08/2017  ...  Investigation complete; no suspect identified\n","\n","[4 rows x 4 columns]"]},"metadata":{},"execution_count":6}]},{"cell_type":"code","metadata":{"id":"y0kHz-UeDttI","colab":{"base_uri":"https://localhost:8080/","height":708},"executionInfo":{"status":"ok","timestamp":1637792834440,"user_tz":-60,"elapsed":5,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}},"outputId":"0d93ce25-354f-48e4-a910-80343efa4dc9"},"source":["#4. I crimini seguiti dal poliziotto che si chiama Christian Hannam\n","\n","#In questo caso se esistessero due Hannam allora bisognerebbe specificare anche il rank.\n","\n","cypher_query = '''\n","\n","MATCH (c:Crime)-[:INVESTIGATED_BY]->(o:Officer)\n","WHERE o.name = 'Christian' AND o.surname = 'Hannam'\n","RETURN c\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>date</th>\n","      <th>id</th>\n","      <th>last_outcome</th>\n","      <th>type</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>11/08/2017</td>\n","      <td>23f4a74d85130c92c496a17bb3f6d80dac6cfa8773e76c...</td>\n","      <td>Unable to prosecute suspect</td>\n","      <td>Violence and sexual offences</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>19/08/2017</td>\n","      <td>a1284e44195941819799a20f634dd5bc0c6a599ef1d9e0...</td>\n","      <td>Local resolution</td>\n","      <td>Criminal damage and arson</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>4/08/2017</td>\n","      <td>aacff8850d0af4537ec79fb1c8869a560b9925a73441df...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Vehicle crime</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>26/08/2017</td>\n","      <td>6d51d17dd4fdb62d5d108ebefc6c3cc8894f50f5a17c92...</td>\n","      <td>Offender given a drugs possession warning</td>\n","      <td>Drugs</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>11/08/2017</td>\n","      <td>f4713af2c4e19ecf05885b405104d286c3cd1df696814c...</td>\n","      <td>Further investigation is not in the public int...</td>\n","      <td>Criminal damage and arson</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>28/08/2017</td>\n","      <td>cf41ea73b3aafa8097360cedf178603d4246309050e75f...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Vehicle crime</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>21/08/2017</td>\n","      <td>665beb93dbf15a1870392a6d5484bf956f46f73e4fdd67...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Bicycle theft</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>15/08/2017</td>\n","      <td>19a2059b8e2a0b509412b80e732c2b762b7ebcfc5f24db...</td>\n","      <td>Unable to prosecute suspect</td>\n","      <td>Violence and sexual offences</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>7/08/2017</td>\n","      <td>3ee432b421e9baf4873f7726b4d2acab75bf7f79b0e215...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Theft from the person</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>12/08/2017</td>\n","      <td>0fcb44efce1647a3681bb74f9c7ff7c5484d458e7eee0f...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Other theft</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>28/08/2017</td>\n","      <td>6ca12001159e57731e3fb9c8068502a2a896012086152f...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Vehicle crime</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>30/08/2017</td>\n","      <td>618bec0e7e84a8a2254ab12fe73fce8689073939d1d380...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Violence and sexual offences</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>27/08/2017</td>\n","      <td>dd0c5f078845f75b846f23b1d506d2c133c09f91ef6e14...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Theft from the person</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>18/08/2017</td>\n","      <td>10f6a88c2d4ea31f7a9bc3eb4e0a07f71250e753d1f642...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Other theft</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>18/08/2017</td>\n","      <td>3727dea78486680c7f0d0ba77ee4cba3cfcdf7c4d67d9a...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Shoplifting</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>10/08/2017</td>\n","      <td>e6537cce7e5e701176646e29d4044253189c4cfb51d5ca...</td>\n","      <td>Under investigation</td>\n","      <td>Criminal damage and arson</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>1/08/2017</td>\n","      <td>95aa48b5abeb8af9f632547613d6440f02ab4db2416599...</td>\n","      <td>Unable to prosecute suspect</td>\n","      <td>Violence and sexual offences</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>23/08/2017</td>\n","      <td>e7e737afad8d36118ef30ece2c4c4d259a8b8eed64ccea...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Public order</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>1/08/2017</td>\n","      <td>86ae3012b90c4b2fd3284438ae56d8b7dd76a210a3a843...</td>\n","      <td>Unable to prosecute suspect</td>\n","      <td>Violence and sexual offences</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>28/08/2017</td>\n","      <td>023d7936f2b0faca2c9ef51604cee77bc9d13495f9ee13...</td>\n","      <td>Investigation complete; no suspect identified</td>\n","      <td>Other theft</td>\n","    </tr>\n","    <tr>\n","      <th>20</th>\n","      <td>18/08/2017</td>\n","      <td>3ff357e11bda6193e32714678b32cb0fc79df88d493c7e...</td>\n","      <td>Under investigation</td>\n","      <td>Robbery</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["          date  ...                          type\n","0   11/08/2017  ...  Violence and sexual offences\n","1   19/08/2017  ...     Criminal damage and arson\n","2    4/08/2017  ...                 Vehicle crime\n","3   26/08/2017  ...                         Drugs\n","4   11/08/2017  ...     Criminal damage and arson\n","5   28/08/2017  ...                 Vehicle crime\n","6   21/08/2017  ...                 Bicycle theft\n","7   15/08/2017  ...  Violence and sexual offences\n","8    7/08/2017  ...         Theft from the person\n","9   12/08/2017  ...                   Other theft\n","10  28/08/2017  ...                 Vehicle crime\n","11  30/08/2017  ...  Violence and sexual offences\n","12  27/08/2017  ...         Theft from the person\n","13  18/08/2017  ...                   Other theft\n","14  18/08/2017  ...                   Shoplifting\n","15  10/08/2017  ...     Criminal damage and arson\n","16   1/08/2017  ...  Violence and sexual offences\n","17  23/08/2017  ...                  Public order\n","18   1/08/2017  ...  Violence and sexual offences\n","19  28/08/2017  ...                   Other theft\n","20  18/08/2017  ...                       Robbery\n","\n","[21 rows x 4 columns]"]},"metadata":{},"execution_count":7}]},{"cell_type":"code","metadata":{"id":"Mpbmx94KDttJ","colab":{"base_uri":"https://localhost:8080/","height":112},"executionInfo":{"status":"ok","timestamp":1637828534956,"user_tz":-60,"elapsed":564,"user":{"displayName":"Zanella Luca","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Ghyop3_Qi07yUBSpeVrYZ_BJOTfEM7wxFSFs2-p=s64","userId":"01105344999156681576"}},"outputId":"50759ddb-7eb6-43cb-fd44-ba87b43dee3a"},"source":["#5. Il tipo dei crimini seguiti da Christian Hannam che sono ancora 'under investigation'\n","\n","cypher_query = '''\n","\n","MATCH (c:Crime {last_outcome:\"Under investigation\"})-[:INVESTIGATED_BY]->(o:Officer)\n","WHERE o.name = 'Christian' AND o.surname = 'Hannam'\n","RETURN c\n","\n","'''\n","\n","read_cypher(cypher_query)\n"],"execution_count":5,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>date</th>\n","      <th>id</th>\n","      <th>last_outcome</th>\n","      <th>type</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>10/08/2017</td>\n","      <td>e6537cce7e5e701176646e29d4044253189c4cfb51d5ca...</td>\n","      <td>Under investigation</td>\n","      <td>Criminal damage and arson</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>18/08/2017</td>\n","      <td>3ff357e11bda6193e32714678b32cb0fc79df88d493c7e...</td>\n","      <td>Under investigation</td>\n","      <td>Robbery</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["         date  ...                       type\n","0  10/08/2017  ...  Criminal damage and arson\n","1  18/08/2017  ...                    Robbery\n","\n","[2 rows x 4 columns]"]},"metadata":{},"execution_count":5}]},{"cell_type":"code","metadata":{"id":"HjMRlcaxDttJ","outputId":"6a68bb2a-42b5-49c3-9e75-88f9b866a62b"},"source":["#6. Gli indirizzi dei crimini su cui Christian Hannam sta ancora investigando\n","\n","cypher_query = '''\n","\n","MATCH (o:Officer)<-[:INVESTIGATED_BY]-(c:Crime{last_outcome:\"Under investigation\"})-[:OCCURRED_AT]->(l:Location)\n","WHERE o.name = 'Christian' AND o.surname = 'Hannam'\n","RETURN l.address\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>l.address</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>13 Stovell Road</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>114 Wigan Road</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["         l.address\n","0  13 Stovell Road\n","1   114 Wigan Road"]},"execution_count":23,"metadata":{},"output_type":"execute_result"}]},{"cell_type":"code","metadata":{"id":"rOeLtUOlDttK","outputId":"77dbe273-def7-416d-e751-150f53566b4e"},"source":["#7. L’area dei crimini su cui Christian Hannam sta ancora investigando\n","\n","cypher_query = '''\n","\n","MATCH (o:Officer)<-[:INVESTIGATED_BY]-(c:Crime{last_outcome:\"Under investigation\"})-[:OCCURRED_AT]->(l:Location)-[:LOCATION_IN_AREA]->(a:Area)\n","WHERE o.name = 'Christian' AND o.surname = 'Hannam'\n","RETURN a.areaCode\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>a.areaCode</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>M40</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>BL3</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["  a.areaCode\n","0        M40\n","1        BL3"]},"execution_count":28,"metadata":{},"output_type":"execute_result"}]},{"cell_type":"code","metadata":{"id":"SuAq6ycbDttL","outputId":"6def0084-6411-4501-e8e2-ba68860c8ab7"},"source":["#8. Il numero di poliziotti per ogni grado. Ordinare dal grado che ha più poliziotti a scendere.\n","\n","cypher_query = '''\n","\n","MATCH (o:Officer)\n","RETURN o.rank, count(o.rank) ORDER BY count(o.rank) DESC\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>o.rank</th>\n","      <th>count(o.rank)</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Police Constable</td>\n","      <td>375</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Sergeant</td>\n","      <td>336</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Inspector</td>\n","      <td>199</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Chief Inspector</td>\n","      <td>90</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["             o.rank  count(o.rank)\n","0  Police Constable            375\n","1          Sergeant            336\n","2         Inspector            199\n","3   Chief Inspector             90"]},"execution_count":27,"metadata":{},"output_type":"execute_result"}]},{"cell_type":"code","metadata":{"id":"rPsIoPYmDttL","outputId":"4741f5bc-d78c-4bc2-b549-0fbd5bc5b7ef"},"source":["#9. Il grado che ha meno di 200 poliziotti\n","\n","#nell'espressione WITH bisogna assolutamente utilizzare \"AS\"\n","\n","cypher_query = '''\n","\n","MATCH (o:Officer)\n","WITH o.rank AS rank, COUNT(o.rank) AS tot\n","WHERE tot < 200\n","RETURN rank,tot\n","\n","'''\n","\n","read_cypher(cypher_query)"],"execution_count":null,"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>rank</th>\n","      <th>tot</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Inspector</td>\n","      <td>199</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Chief Inspector</td>\n","      <td>90</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["              rank  tot\n","0        Inspector  199\n","1  Chief Inspector   90"]},"execution_count":32,"metadata":{},"output_type":"execute_result"}]}]}